wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_biss.h
/*!
    \file    gd32h77x_edim_biss.h
    \brief   definitions for the EDIM_BISS

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_EDIM_BISS_H
#define GD32H77X_EDIM_BISS_H

#include "gd32h77x.h"

/* CRC definitions */
#define EDIM_BISS                           (EDIM_BASE + 0x00000C00U)

/* registers definitions */
#define EDIM_BISS_SnDATA0(n)                REG32((EDIM_BISS) + 0x00000000U + (0x08U * (n)))    /*!< EDIM_BISS slave n data register 0 */
#define EDIM_BISS_SnDATA1(n)                REG32((EDIM_BISS) + 0x00000004U + (0x08U * (n)))    /*!< EDIM_BISS slave n data register 1 */
#define EDIM_BISS_CCDATAx(n)                REG32((EDIM_BISS) + 0x00000080U + (0x04U * (n)))    /*!< EDIM_BISS control communication data n register */
#define EDIM_BISS_SnPDTCFG(n)               REG32((EDIM_BISS) + 0x000000C0U + (0x04U * (n)))    /*!< EDIM_BISS slave n process data transmission configuration register */
#define EDIM_BISS_CCFG0                     REG32((EDIM_BISS) + 0x000000E0U)                    /*!< EDIM_BISS communication configuration register 0 */
#define EDIM_BISS_CCFG1                     REG32((EDIM_BISS) + 0x000000E4U)                    /*!< EDIM_BISS communication configuration register 1 */
#define EDIM_BISS_FREP                      REG32((EDIM_BISS) + 0x000000E8U)                    /*!< EDIM_BISS frame repetition register */
#define EDIM_BISS_CNTINTEN                  REG32((EDIM_BISS) + 0x000000ECU)                    /*!< EDIM_BISS counter and interrupt enable register */
#define EDIM_BISS_STAT0                     REG32((EDIM_BISS) + 0x000000F0U)                    /*!< EDIM_BISS status register 0 */
#define EDIM_BISS_CCFG2                     REG32((EDIM_BISS) + 0x000000F4U)                    /*!< EDIM_BISS communication configuration register 2 */
#define EDIM_BISS_STAT1                     REG32((EDIM_BISS) + 0x000000F8U)                    /*!< EDIM_BISS status register 1 */
#define EDIM_BISS_DFCTL                     REG32((EDIM_BISS) + 0x000000FCU)                    /*!< EDIM_BISS DMA and FIFO control register */
#define EDIM_BISS_FIFODATA                  REG32((EDIM_BISS) + 0x00000200U)                    /*!< EDIM_BISS FIFO data register */

/* bits definitions */
/* EDIM_BISS_SnDATA0 */
#define EDIM_BISS_SnDATA0_DATAL             BITS(0,31)                           /*!< EDIM_BISS low double word process data of slave n */

/* EDIM_BISS_SnDATA1 */
#define EDIM_BISS_SnDATA1_DATAH             BITS(0,31)                           /*!< EDIM_BISS high double word process data of slave n */

/* EDIM_BISS_CCDATAx */
#define EDIM_BISS_CCDATAx_CCDATA            BITS(0,31)                           /*!< EDIM_BISS control communication data */

/* EDIM_BISS_SnPDTCFG */
#define EDIM_BISS_SnPDTCFG_PDLEN            BITS(0,5)                            /*!< EDIM_BISS process data length */
#define EDIM_BISS_SnPDTCFG_PDTEN            BIT(6)                               /*!< EDIM_BISS process data transmission enable */
#define EDIM_BISS_SnPDTCFG_CRCPOLY          BITS(8,14)                           /*!< EDIM_BISS CRC polynomial */
#define EDIM_BISS_SnPDTCFG_CRCMSEL          BIT(15)                              /*!< EDIM_BISS CRC mode selection */
#define EDIM_BISS_SnPDTCFG_CRCIVAL          BITS(16,31)                          /*!< EDIM_BISS CRC initial value */

/* EDIM_BISS_CCFG0 */
#define EDIM_BISS_CCFG0_REGADDR             BITS(16,22)                         /*!< EDIM_BISS register communication start address */
#define EDIM_BISS_CCFG0_REGWRSEL            BIT(23)                             /*!< EDIM_BISS register communication write/read mode selection */
#define EDIM_BISS_CCFG0_REGNUM              BITS(24,29)                         /*!< EDIM_BISS the number of consecutive communication registers in register communication mode */

/* EDIM_BISS_CCFG1 */
#define EDIM_BISS_CCFG1_MASEL               BIT(8)                              /*!< EDIM_BISS MA signal level selection at the end of frame*/
#define EDIM_BISS_CCFG1_CMD                 BITS(11,13)                         /*!< EDIM_BISS command */
#define EDIM_BISS_CCFG1_CMD_IDACHK          BIT(11)                             /*!< EDIM_BISS ID acknowledge bit trigger command */
#define EDIM_BISS_CCFG1_CTS                 BIT(15)                             /*!< EDIM_BISS command communication mode selection */
#define EDIM_BISS_CCFG1_RAMNUM              BIT(24)                             /*!< EDIM_BISS number of RAM banks used for process data */
#define EDIM_BISS_CCFG1_CRCSEN              BIT(25)                             /*!< EDIM_BISS CRC storage enable */

