wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_biss.h
/* EDIM_BISS_FREP */
#define EDIM_BISS_FREP_FREP                 BITS(0,19)                          /*!< EDIM_BISS frame automatic repetition rate */

/* EDIM_BISS_CNTINTEN */
#define EDIM_BISS_CNTINTEN_EODTIE           BIT(1)                              /*!< EDIM_BISS end of data transfer interrupt enable */
#define EDIM_BISS_CNTINTEN_CCERRIE          BIT(2)                              /*!< EDIM_BISS communication control error interrupt enable */
#define EDIM_BISS_CNTINTEN_PDTERRIE         BIT(3)                              /*!< EDIM_BISS process data transmission error interrupt enable */
#define EDIM_BISS_CNTINTEN_SERRIE           BIT(4)                              /*!< EDIM_BISS start bit error interrupt enable */
#define EDIM_BISS_CNTINTEN_ADTERRIE         BIT(5)                              /*!< EDIM_BISS automatic data transmission error interrupt enable */
#define EDIM_BISS_CNTINTEN_DMATOIE          BIT(7)                              /*!< EDIM_BISS DMA request timeout interrupt enable */
#define EDIM_BISS_CNTINTEN_FIFOUNRIE        BIT(8)                              /*!< EDIM_BISS FIFO underrun interrupt enable */
#define EDIM_BISS_CNTINTEN_FIFOOVRIE        BIT(9)                              /*!< EDIM_BISS FIFO overrun interrupt enable */
#define EDIM_BISS_CNTINTEN_FCNT             BITS(16,28)                         /*!< EDIM_BISS the count value from the BiSS frame's slave response ACK to the CDM timeout confirmation bit */

/* EDIM_BISS_STAT0 */
#define EDIM_BISS_STAT0_EODT                BIT(0)                              /*!< EDIM_BISS end of data transmission flag */
#define EDIM_BISS_STAT0_EOFT                BIT(1)                              /*!< EDIM_BISS end of frame transmission flag */
#define EDIM_BISS_STAT0_EOCC                BIT(2)                              /*!< EDIM_BISS end of control communication flag */
#define EDIM_BISS_STAT0_CCERRIF             BIT(3)                              /*!< EDIM_BISS control communication error flag */
#define EDIM_BISS_STAT0_PDTERRIF            BIT(4)                              /*!< EDIM_BISS process data transmission error flag */
#define EDIM_BISS_STAT0_SERRIF              BIT(5)                              /*!< EDIM_BISS start bit error interrupt flag */
#define EDIM_BISS_STAT0_ADTERRIF            BIT(6)                              /*!< EDIM_BISS automatic data transmission error interrupt flag */
#define EDIM_BISS_STAT0_INERRF              BIT(7)                              /*!< EDIM_BISS internal error flag */
#define EDIM_BISS_STAT0_SLVF                BITS(8,23)                          /*!< EDIM_BISS slave n data validity flags */
#define EDIM_BISS_STAT0_VREGNUM             BITS(24,29)                         /*!< EDIM_BISS number of valid register from addressed slave in register communication */
#define EDIM_BISS_STAT0_CDS                 BIT(30)                             /*!< EDIM_BISS CDS bit */
#define EDIM_BISS_STAT0_CDMTOF              BIT(31)                             /*!< EDIM_BISS CDM timeout completion flag */

/* EDIM_BISS_CCFG2 */
#define EDIM_BISS_CCFG2_ADTEN               BIT(0)                              /*!< EDIM_BISS automatic data transmission enable */
#define EDIM_BISS_CCFG2_FCTL                BITS(1,3)                           /*!< EDIM_BISS frame control */
#define EDIM_BISS_CCFG2_TINIT               BIT(4)                              /*!< EDIM_BISS transmit BiSS initialization sequence */
#define EDIM_BISS_CCFG2_RBSW                BIT(5)                              /*!< EDIM_BISS RAM bank force switching */
#define EDIM_BISS_CCFG2_RBSWDIS             BIT(6)                              /*!< EDIM_BISS RAM bank automatic switching disable */
#define EDIM_BISS_CCFG2_BRKDT               BIT(7)                              /*!< EDIM_BISS break data transmission */
#define EDIM_BISS_CCFG2_MACSEL              BIT(12)                             /*!< EDIM_BISS MA line level control source selection */
#define EDIM_BISS_CCFG2_MALVL               BIT(13)                             /*!< EDIM_BISS MA line force level */
#define EDIM_BISS_CCFG2_MAFRE               BITS(14,28)                         /*!< EDIM_BISS process data master clock frequency fMA */

/* EDIM_BISS_STAT1 */
#define EDIM_BISS_STAT1_SLINSTAT            BIT(0)                               /*!< EDIM_BISS SL line input level state */
#define EDIM_BISS_STAT1_CDSBU               BIT(1)                               /*!< EDIM_BISS CDS bit backup */
#define EDIM_BISS_STAT1_SLNUM               BITS(16,19)                          /*!< EDIM_BISS number of slaves in control communication */
#define EDIM_BISS_STAT1_RBSWERRF            BIT(24)                              /*!< EDIM_BISS RAM bank switching error flag */
#define EDIM_BISS_STAT1_DMATOIF             BIT(25)                              /*!< EDIM_BISS DMA request timeout error interrupt flag */
#define EDIM_BISS_STAT1_FIFOUNRIF           BIT(26)                              /*!< EDIM_BISS FIFO underrun interrupt flag */
#define EDIM_BISS_STAT1_FIFOOVRIF           BIT(27)                              /*!< EDIM_BISS FIFO overrun interrupt flag */
#define EDIM_BISS_STAT1_EODTIF              BIT(28)                              /*!< EDIM_BISS end of data transmission interrupt flag */

/* EDIM_BISS_DFCTL */
#define EDIM_BISS_DFCTL_DFEN                BIT(0)                              /*!< EDIM_BISS DMA request and FIFO enable */
#define EDIM_BISS_DFCTL_FIFOFH              BIT(1)                              /*!< EDIM_BISS FIFO flush */
#define EDIM_BISS_DFCTL_DMA_DFEN            BITS(16, 31)                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_SxRDATAy register */
#define EDIM_BISS_DFCTL_DFEN0               BIT(16)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S0RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN1               BIT(17)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S0RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN2               BIT(18)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S1RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN3               BIT(19)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S1RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN4               BIT(20)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S2RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN5               BIT(21)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S2RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN6               BIT(22)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S3RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN7               BIT(23)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S3RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN8               BIT(24)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S4RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN9               BIT(25)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S4RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN10              BIT(26)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S5RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN11              BIT(27)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S5RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN12              BIT(28)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S6RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN13              BIT(29)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S6RDATA1 register */
#define EDIM_BISS_DFCTL_DFEN14              BIT(30)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S7RDATA0 register */
#define EDIM_BISS_DFCTL_DFEN15              BIT(31)                             /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S7RDATA1 register */

/* EDIM_BISS_FIFODATA */
#define EDIM_BISS_FIFODATA_FIFODATA         BITS(0,31)                          /*!< EDIM_BISS FIFO data from EDIM_BISS_SnDATA0/1 (n = 0��7) registers */

