wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_biss.h
#define EDIM_BISS_DMASEL_SLVn_DATAm(n, m)                 BIT((16U) + ((n) << 1U) + (m))

typedef enum{
    EDIM_BISS_SLAVE_BROADCAST   = 0x00,                                                     /*!< EDIM_BISS broadcast mode */
    EDIM_BISS_SLAVE0            = 0x01,                                                     /*!< EDIM_BISS slave 0 */
    EDIM_BISS_SLAVE1            = 0x02,                                                     /*!< EDIM_BISS slave 1 */
    EDIM_BISS_SLAVE2            = 0x04,                                                     /*!< EDIM_BISS slave 2 */
    EDIM_BISS_SLAVE3            = 0x08,                                                     /*!< EDIM_BISS slave 3 */
    EDIM_BISS_SLAVE4            = 0x10,                                                     /*!< EDIM_BISS slave 4 */
    EDIM_BISS_SLAVE5            = 0x20,                                                     /*!< EDIM_BISS slave 5 */
    EDIM_BISS_SLAVE6            = 0x40,                                                     /*!< EDIM_BISS slave 6 */
    EDIM_BISS_SLAVE7            = 0x80,                                                     /*!< EDIM_BISS slave 7 */
    EDIM_BISS_ALLSLAVE          = 0xFF,                                                     /*!< EDIM_BISS all slave */
}edim_biss_slave_enum;

/* EDIM_BISS master frame automatic repetition rate  */
#define MACFG_FREP(regval)                                   (BITS(0, 19) & ((uint32_t)(regval) << 0))
#define EDIM_BISS_AUTO_DATA_TRANSMIT_RATE_MAX                 MACFG_FREP(0)                  /*!< the highest frame rate for automatically restarting the next frame */
#define EDIM_BISS_AUTO_DATA_TRANSMIT_EXT_TRIGGER              MACFG_FREP(1)                  /*!< the master requires a trigger signal to restart the next frame */
#define EDIM_BISS_AUTO_DATA_TRANSMIT_RATE_DIV(x)              MACFG_FREP(((x) >> 1U) - 1U)   /*!< fPCLK / x */

/* EDIM_BISS process data master clock frequency */
#define CTL_MAFRE(regval)                                    (BITS(14, 28) & ((uint32_t)(regval) << 14))

/* EDIM_BISS register communication start address */
#define CTLCOMMCFG0_REGADDR(regval)                          (BITS(16, 22) & ((uint32_t)(regval) << 16))

/* EDIM_BISS the number of consecutive communication registers in register communication mode */
#define CTLCOMMCFG0_REGNUM(regval)                           (BITS(24, 29) & ((uint32_t)(regval) << 24))

/* EDIM_BISS register communication slave address */
#define CTLCOMMCFG1_SLAVEID(regval)                          (BITS(11, 13) & ((uint32_t)(regval) << 11))

/* EDIM_BISS command selection for BiSS command */
#define CTLCOMMCFG1_CMD(regval)                              (BITS(12, 13) & ((uint32_t)(regval) << 12))
#define EDIM_BISS_CMD_CHECKIDA(cmd)                          (CTLCOMMCFG1_CMD(cmd) | EDIM_BISS_CCFG1_CMD_IDACHK)   /*!< after successful checking of the ID acknowledge bit */
#define EDIM_BISS_CMD_ALWAYSEXE(cmd)                         (CTLCOMMCFG1_CMD(cmd))                                /*!< BiSS commands execute immediately */

/* EDIM_BISS MA signal level at the end of frame */
#define EDIM_BISS_MA_HIGH_END                                ((uint32_t)0x00000000U)                               /*!< after the slave timeout is detected on SL, MA changes to the digital high level */
#define EDIM_BISS_MA_MAINTAIN_END                            EDIM_BISS_CCFG1_MASEL                                 /*!< MA maintains level until the next frame begins */

/* EDIM_BISS crc polynomial */
#define SLVnCFG_CRCPOLY(regval)                              (BITS(8, 14) & ((uint32_t)(regval) << 8))
#define EDIM_BISS_SLAVE_CRC_NO_CRC                           (SLVnCFG_CRCPOLY(0x00))                               /*!< CRC verification is disabled. */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC3_0x0B             (SLVnCFG_CRCPOLY(0x03))                               /*!< CRC polynomial is 0x0B */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC4_0x13             (SLVnCFG_CRCPOLY(0x04))                               /*!< CRC polynomial is 0x13 */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC5_0x25             (SLVnCFG_CRCPOLY(0x05))                               /*!< CRC polynomial is 0x25 */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC6_0x43             (SLVnCFG_CRCPOLY(0x06))                               /*!< CRC polynomial is 0x43 */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC7_0x89             (SLVnCFG_CRCPOLY(0x07))                               /*!< CRC polynomial is 0x89 */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC8_0x12F            (SLVnCFG_CRCPOLY(0x08))                               /*!< CRC polynomial is 0x12F */
#define EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC16_0x190D9         (SLVnCFG_CRCPOLY(0x10))                               /*!< CRC polynomial is 0x190D9 */
#define EDIM_BISS_SLAVE_CRC_CUSTOM(x)                        (EDIM_BISS_SnPDTCFG_CRCMSEL | SLVnCFG_CRCPOLY(((x) & 0xFF) >> 1))    /*!< individual CRC polynomial */

/* EDIM_BISS process data length */
#define SLVnCFG_PDLEN(regval)                                (BITS(0, 5) & ((uint32_t)(regval) << 0))
#define EDIM_BISS_SLAVE_DATALENGTH(x)                        (SLVnCFG_PDLEN(((x) - 1) & 0x3F))                       /*!< process data bit length is x */

/* EDIM_BISS frame control */
#define CTL_FCTL(regval)                                             (BITS(1, 3) & ((uint32_t)(regval) << 1))
#define EDIM_BISS_STOP                                               0U                                            /*!< no frame transimission */
#define EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_1                  CTL_FCTL(1)                                   /*!< trigger one frame with CDM = 1 */
#define EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_0                  CTL_FCTL(2)                                   /*!< trigger one frame with CDM = 0 */
#define EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_INVERSE_CDS        CTL_FCTL(3)                                   /*!< trigger one frame with CDM being the inverse of CDS */
#define EDIM_BISS_SEND_SINGLE_CTRL_FRAME                             CTL_FCTL(4)                                   /*!< trigger one frame with control communication */
#define EDIM_BISS_SEND_SINGLE_CTRL_REDUCED_FRAME                     CTL_FCTL(7)                                   /*!< trigger one reduced frame with control communication */
#define EDIM_BISS_SEND_AUTO_DATA_FRAME_WITH_CDM_1                    (EDIM_BISS_CCFG2_ADTEN | CTL_FCTL(1))         /*!< next frame with CDM = 1 */
#define EDIM_BISS_SEND_AUTO_DATA_FRAME_WITH_CDM_0                    (EDIM_BISS_CCFG2_ADTEN | CTL_FCTL(2))         /*!< next frame with CDM = 0 */
#define EDIM_BISS_SEND_AUTO_DATA_FRAME_WITH_CDM_INVERSE_CDS          (EDIM_BISS_CCFG2_ADTEN | CTL_FCTL(3))         /*!< next frame with CDM being the inverse of CDS */
#define EDIM_BISS_SEND_AUTO_CTRL_FRAME                               (EDIM_BISS_CCFG2_ADTEN | CTL_FCTL(4))         /*!< next frame with control communication */
#define EDIM_BISS_SEND_AUTO_CTRL_REDUCED_FRAME                       (EDIM_BISS_CCFG2_ADTEN | CTL_FCTL(7))         /*!< next reduced frame with control communication */

/* EDIM_BISS DMA request and FIFO control */
#define EDIM_BISS_DMA_SEL_SLV0_DATA0                                 EDIM_BISS_DFCTL_DFEN0                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S0RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV0_DATA1                                 EDIM_BISS_DFCTL_DFEN1                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S0RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV1_DATA0                                 EDIM_BISS_DFCTL_DFEN2                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S1RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV1_DATA1                                 EDIM_BISS_DFCTL_DFEN3                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S1RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV2_DATA0                                 EDIM_BISS_DFCTL_DFEN4                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S2RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV2_DATA1                                 EDIM_BISS_DFCTL_DFEN5                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S2RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV3_DATA0                                 EDIM_BISS_DFCTL_DFEN6                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S3RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV3_DATA1                                 EDIM_BISS_DFCTL_DFEN7                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S3RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV4_DATA0                                 EDIM_BISS_DFCTL_DFEN8                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S4RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV4_DATA1                                 EDIM_BISS_DFCTL_DFEN9                         /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S4RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV5_DATA0                                 EDIM_BISS_DFCTL_DFEN10                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S5RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV5_DATA1                                 EDIM_BISS_DFCTL_DFEN11                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S5RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV6_DATA0                                 EDIM_BISS_DFCTL_DFEN12                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S6RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV6_DATA1                                 EDIM_BISS_DFCTL_DFEN13                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S6RDATA1 register */
#define EDIM_BISS_DMA_SEL_SLV7_DATA0                                 EDIM_BISS_DFCTL_DFEN14                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S7RDATA0 register */
#define EDIM_BISS_DMA_SEL_SLV7_DATA1                                 EDIM_BISS_DFCTL_DFEN15                        /*!< EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S7RDATA1 register */

/* function declarations */
/* initialization functions */
/* reset EDIM_BISS */
void edim_biss_deinit(void);
/* initialize EDIM_BISS init parameter struct with a default value */
void edim_biss_init_parameter_struct_para_init(edim_biss_init_parameter_struct *initpara);
/* initialize BiSS-C config */
void edim_biss_init(edim_biss_init_parameter_struct* init_struct);
/* initialize BiSS-C slave and clear rest of the slave */
void edim_biss_slave_config(uint32_t n_slave, edim_biss_slave_parameter_struct slave_config[]);
/* enable specified BiSS-C slave */
void edim_biss_slave_enable(uint32_t slave);
/* disable specified BiSS-C slave */
void edim_biss_slave_disable(uint32_t slave);
/* send BiSS-C initialization sequence */
void edim_biss_initialization_sequence_config(EventStatus newvalue);
/* stop current BiSS-C communication */
void edim_biss_break(void);
/* configure BiSS-C register communication to be sent */
void edim_biss_reg_access(edim_biss_control_comm_struct* ctrl_comm_struct);
/* configure BiSS-C command communication to be sent */
void edim_biss_command(uint32_t slave_id, uint32_t cmd_value);
/* start a new BiSS-C frame with specified mode */
void edim_biss_send_frame(uint32_t frame_config);
/* configure prescale value of automatic data transmission mode */
void edim_biss_auto_transmission_config(uint32_t perscaler);
/* store process data CRC value into EDIM_BISS_SnDATA0/1 */
void edim_biss_store_crc_enable(void);
/* not store process data CRC value into EDIM_BISS_SnDATA0/1 */
void edim_biss_store_crc_disable(void);
/* select ram bank number used for process data */
void edim_biss_rambank_number_select(uint32_t rambank_num);
/* enable automatic ram bank switching */
void edim_biss_rambank_auto_switching_enable(void);
/* disable automatic ram bank switching */
void edim_biss_rambank_auto_switching_disable(void);
/* force ram bank switching */
void edim_biss_rambank_force_switching(void);
/* select MA signal level at the end of frame */
void edim_biss_ma_end_level_select(uint32_t ma_level);
/* enable dma for BiSS-C slave data receive */
void edim_biss_dma_enable(void);
/* disable dma for BiSS-C slave data receive */
void edim_biss_dma_disable(void);
/* flush dma fifo */
void edim_biss_dma_flush(void);
/* select slave process data to be load into DMA fifo */
void edim_biss_dma_select(uint32_t reg_selected);
/* read EDIM_BISS SnRDATA0/1 */
uint64_t edim_biss_data_read(uint32_t slave_id);
/* configure the count value from the BiSS frame's slave response ACK to the CDM timeout confirmation bit */
void edim_biss_frame_count_value_config(uint32_t frame_cnt);
/* get the number of valid register from addressed slave in register communication */
uint8_t edim_biss_valid_reg_num_get(void);
/* get the number of slaves in control communication */
uint8_t edim_biss_slave_num_get(void);
/* enable EDIM_BISS interrupt */
void edim_biss_interrupt_enable(uint32_t interrupt);
/* disable EDIM_BISS interrupt */
void edim_biss_interrupt_disable(uint32_t interrupt);
/* get EDIM_BISS interrupt flag */
FlagStatus edim_biss_interrupt_flag_get(edim_biss_interrupt_flag_enum int_flag);
/* clear EDIM_BISS interrupt flag */
void edim_biss_interrupt_flag_clear(edim_biss_interrupt_flag_enum int_flag);
/* get EDIM_BISS flag */
FlagStatus edim_biss_flag_get(edim_biss_flag_enum flag);
/* clear EDIM_BISS flag */
void edim_biss_flag_clear(edim_biss_flag_enum flag);

#endif /* GD32H77X_EDIM_BISS_H */
